[
    {
        "id": "684a23274ba06",
        "date": "2024-07-04",
        "title": "Interview in Lahore – A New Beginning",
        "desc": "This was the first step of trust and love that brought you closest to my heart.",
        "img": "uploads\/1749689127_R.jpeg"
    },
    {
        "id": "684a266d88a9f",
        "date": "2024-08-11",
        "title": "Moved Permanently to Lahore – A New Chapter Begins",
        "desc": "The day you came to Lahore to stay forever was the start of something truly special. It brought us closer not just in distance, but in heart and soul. This step turned our story into a shared journey filled with love, laughter, and countless memories waiting to be made.",
        "img": "uploads\/1749689965_R (2).jpeg"
    },
    {
        "id": "684a2757a680c",
        "date": "2024-08-03",
        "title": "Proposal Accepted – A Promise Sealed",
        "desc": "The moment when (ZARA) said yes was the most beautiful turning point of my life. It marked the beginning of a forever filled with love, trust, and shared dreams.",
        "img": "uploads\/1749690199_R (1).jpeg"
    },
    {
        "id": "684a293e6c9a9",
        "date": "2024-08-27",
        "title": "Our First Meetup – Nervous Yet Unforgettable",
        "desc": "It was our very first time meeting in person — full of nerves, confusion, and a bit of fear. But despite all that, it turned out to be one of the most beautiful and memorable days of our journey. A day that marked the beginning of something truly special.",
        "img": "uploads\/1749690686_R (3).jpeg"
    },
    {
        "id": "684a2bd2f2f0a",
        "date": "2024-05-18",
        "title": "Our Very First Connection",
        "desc": "We first met on Snapchat, where a simple conversation turned into countless chats. We shared so much, laughed together, and slowly became friends. Eventually, our bond grew stronger and moved to WhatsApp — and that’s where our real journey began.",
        "img": "uploads\/1749691346_2023-07-07-CV-censorship2.jpg"
    },
    {
        "id": "684a2da7ea910",
        "date": "2024-09-13",
        "title": "Our Second Meetup",
        "desc": "Those days were truly unforgettable. You cared so much and were always thoughtful — I never once felt like you weren’t mine. What I loved the most was seeing the love in your eyes for me… it made me feel incredibly special and deeply cherished.",
        "img": "uploads\/1749691815_OIP.jpeg"
    }
]